{"basics":{"name":"Ryan Sutherland","label":"Ph.D Student","image":"","email":"Sutherry@oregonstate.edu","phone":"(863)-377-1825","url":"","summary":"A Canadian Robotics Student interested in Human Robot Interaction","location":{"address":"2712 Broadway St","postalCode":"CA 94115","city":"San Francisco","countryCode":"US","region":"California"},"profiles":[]},"skills":[{"name":"Programming","level":"Master","icon":"fa-solid fa-hashtag","keywords":["Python","C++","C","MATLAB","Java","Machine Learning Certificate"]},{"name":"Electrical","level":"Master","icon":"fa-solid fa-hashtag","keywords":["PCB Development","Soldering","Multimeter","Oscilliscope","Wave Form Generators"]},{"name":"Mechanical","level":"Master","icon":"fa-solid fa-hashtag","keywords":["SolidWorks","Fusion360","Rapid Prototyping","Lathe","Milling Machine"]}],"projects":[{"name":"Fuel Cell Defect Detection - Capstone","highlights":["Responsible for creating an automated, AI powered system capable of classifying various defects found on fuel cells.","Developed a structure to introduce controlled lighting and surface conditions.","Utilized and implemented existing YOLO framework to classify and identify regions of defects."],"startDate":"2022-09","endDate":"2023-04","url":""},{"name":"UBC Biomedical Engineering Student Team (Co-Captain Projects)","highlights":["Responsible for helping teams develop timelines and aid in project management.","Communicating with faculty about reserving proper meeting and prototyping space.","Developed various pipelines to streamline processes including: on-boarding, training and project proposals."],"startDate":"2022-09","endDate":"2023-08","url":""},{"name":"UBC Biomedical Engineering Student Team (SportsMed)","highlights":["Founded SportsMed team to reimagine ways of treating and preventing common sports injuries.","Developing a core-activation device that informs users of ways to improve their posture and strength abdominal muscles.","Delegated research topics to team members and ensured constant communication between individuals."],"startDate":"2021-09","endDate":"2023-08","url":""},{"name":"Can Collection Robot","highlights":["Designed robot using CAD, ensuring all components could effectively be integrated using assemblies.","Created custom PCBs for effective power distribution and signal management.","Created a state-machine that allowed all components of the robot to work together synchronously with precise timing for specific tasks.","Placed 3rd in competition."],"startDate":"2021-05","endDate":"2021-09","url":""},{"name":"Plate Recognition Robot","highlights":["Developed code for a robot in gazebo to drive a course and recognize car plates while avoiding obstacles.","Used a PID loop to effectively control sharp turns with minimal shaking afterwards.","Created a pedestrian/car avoidance system using image subtraction to identify movement.","Trained two neural networks using TensorFlow to identify letters and numbers."],"startDate":"2021-09","endDate":"2021-12","url":""},{"name":"UBC Biomedical Engineering Student Team (MINT)","highlights":["Developed an electrode headset to read brain waves to enable individuals to perform day to day tasks through thought.","Designed a mechanical headset that was adaptable to all head sizes and integrable with headset electronics.","Prototyped headset using SolidWorks and rapid prototyping techniques.","Tested parts by ensuring that they fit on various head sizes and parts functioned cohesively with electrical aspects."],"startDate":"2019-09","endDate":"2021-05","url":""},{"name":"Autonomous Soccer Playing Robots","highlights":["Designed and prototyped all aspects of the robot using Arduino coding and CAD.","Determined proper motherboard and motor shield need to function with components.","Fully soldered a breadboard ensuring proper power distribution to several components simultaneously.","Ensured effective integration of numerous components into a functioning and coherent system while limiting brownouts.","Represented Canada in WorldCup Junior, placing within the top 30% of all teams."],"startDate":"2016-09","endDate":"2018-06","url":""},{"name":"FPGA Machine Learning Application for LHC - Capstone","highlights":["Developed a pipeline for Large Hadron Collider experiments that would allow ATLAS to disregard 'un-interesting' interactions, saving computer storage .","Prototyped models on an FPGA and analyzed metrics to ensure speed constraints and precision were retained."],"startDate":"2023-09","endDate":"2024-04","url":""}],"work":[{"company":"ConeTec","position":"Mechanical Engineering Intern","website":"https://www.conetec.com/","location":"Burnaby, BC","startDate":"2021-01","endDate":"2021-01","highlights":["Created precise SolidWorks drawings for use by machinists","Designed custom PCB for accurately controlling motor outputs"]},{"company":"TRAIN Fitness","position":"Machine Learning/Full Stack Intern","url":"https://www.trainfitness.ai/","location":"Toronto, ON","startDate":"2022-05","endDate":"2022-12","highlights":["Created an automated labeling system using computer vision techniques to increase data available for model training.","Developed AI that could identify wrong form exercises with 98% accuracy.","Interacted and parsed through large data files to extract vital information and pinpoint potential flaws in our database.","Developed position estimation algorithm to identify users movement through space given sensors available on the watch."]},{"company":"Sparkmate","position":"Product Engineer","website":"https://www.sparkmate.com/","location":"Paris, France","startDate":"2023-05","endDate":"2023-08","highlights":["Joined a team of engineers to develop a wine fridge that could individually cool wine bottles to various temperatures","Designed a custom PCB that could integrate 8 different compartments with various sensors and features","Wrote C++ code to control the hardware of the system ensuring each compartment was held at the appropriate temperature.","Developed a python GUI to analyze, store, and plan testing of the device."]}],"education":[{"institution":"Oregon State University","location":"Corvallis, Oregon","url":"https://engineering.oregonstate.edu/CoRIS","area":"Human Robot Interaction","studyType":"Ph.D, Robotics","startDate":"2024-09","endDate":"Present","score":"10","courses":[]},{"institution":"University of British Columbia","location":"Vancouver, BC","url":"https://www.engphys.ubc.ca/","area":"","studyType":"B.Apsc, Engineering Physics","startDate":"2019-09","endDate":"2024-05","score":"10","courses":["Cumalative Average - 82.9%","Graduated with Distinction in Co-Operative Education Program","Dean's Honour's List"]}],"interests":[{"name":"Physics","icon":"fa-solid fa-tag","keywords":["Quantum Mechanics","Quantum Computing","Quantum Information","Quantum Cryptography","Quantum Communication","Quantum Teleportation"]}]}